#include <iostream>
#include "basics.h"



void basics() {
    std::cout << "OOP Basics" << std::endl;
    // Поліморфізм – поєднання до єдиного масиву (колекції)
    // об'єктів різного типу. Формально, об'єкти мають один
    // тип (базового класу), при цьому фактично є об'єктами
    // похідних (дочірніх) типів
#pragma region Objects
    Product* stock[2];

    stock[0] = (new Laptop())
        ->setHardware("Intel core 5, RAM 16GB, SSD 512GB")
        ->setPower(90)
        ->setName("Acer Nitro")
        ->setPrice(60499);

    stock[1] = (new Monitor())
        ->setDiagonal(32)
        ->setPower(120)
        ->setName("Dell Vision")
        ->setPrice(7950);

    for (auto product : stock) {
        std::cout << product->toString() << std::endl;
    }
#pragma endregion


}

/* Основні принципи ООП.
Абстрагування, спадкування, поліморфізм, інкапсуляція.
Абстракція  – термін, що означає поєднання деякої множини сутностей.
Приклад – природна мова. Майже будь-яке слово значить множину.
"Телефон" – величезна множина реальних речей (сутностей).
Машинним мовам абстракція не властива, інструкції мають чітке вираження.
Абстрагування – побудова мовних конструкцій, здатних поєднувати множинні властивості (сутності та інші абстракції).

Створення абстракцій передбачає вивчення (аналіз) предметної області
(чому присвячена програма). Наприклад, крамниця. Виписуємо усі товари,
що мають бути в крамниці, з усіма їх важливими характеристиками.

Ноутбук                Монітор                Миша                  Клавіатура
– назва                – назва                – назва                – назва
– ціна                 – ціна                 – ціна                 – ціна
– "залізо"             – діагональ            – DPI                  – тип
– потужність           – потужність           – підключення          – підключення

1) Знаходимо, що є спільного у ВСІХ сутностей: назва та ціна
формуємо вищу абстракію: товар (Product), що поєднує все, що в нас є
                     Product
                     – назва    –– інкапсуляція – переміщення спільних
                     – ціна        властивостей до абстрацій
        /             /            \                    \
Ноутбук               Монітор        Миша                 Клавіатура
– "залізо"            – діагональ       – DPI                – тип
– потужність          – потужність      – підключення        – підключення

2) Знаходимо групи зі спільними властивостями і будуємо наступний рівень абстракцій:
 Електротовари (-потужність)    Периферія (-підключення)

                       Product
                       – назва – ціна
            /                         \
     Електротовари                 Периферія
     – потужність                  – підключення
      /         \                   /         \
Ноутбук         Монітор       Миша            Клавіатура
– "залізо"      – діагональ   – DPI           – тип

-------------------
Віртуальні методи
Різниця між віртуальними та невіртуальними методами виникає коли тип
даних посилання на об'єкт та тип самого об'єкта не є однаковими.
(посилання через батьківський тип)
Electrical* stock = new Laptop()
тип посилання (stock) – Electrical*
тип об'єкту – Laptop*
Віртуальні методи викликаються у об'єкта
    stock->v() -- Laptop::v
 Невіртуальні методи – за типом даних
    stock->nv() -- Electrical::nv
 Невіртуальні методи створюються за замовчанням,
 для створення віртуальних необхідно додати оператор "virtual"

*/